/*The foods which we will generate from it*/
let data = [
    'فول مدمس', 'سمك سنجاري', 'كشك', 'عجة', 'فلافل', 'شكشوكة', 'بيض مسلوق', 'أرز', 'خبز', 'مشلتت', 'بيصارة', 'ويكا', 'فسيخ', 'بشاميل', 'محشي ورق عنب', 
    'كباب', 'كفتة', 'شركسية', 'شاورما', 'طبيخ', 'باميا', 'بسلة', 'بسلة بالجزر', 'فاصوليا بيضاء', 'فاصوليا خضراء', 'لوبيا', 'بطاطس', 'قلقاس', 'سبانخ',
    'ملوخيه', 'كندوز', 'عجالي/بتلو', 'لباني', 'شامورت', 'بيض مقلي', 'بيض بالبسطرمة', 'زبادي', 'عيش بلدي/فينو', 'لانشون', 'جبنه', 'جبنه بيضاء', 
    'جبنه براميلي', 'جبنه فيتا', 'جبنه حادقه', 'جبنه رومي', 'جبنه مقليه', 'مخلل', 'زيتون', 'بتنجان', 'طعميه محشيه (اسكندراني)', 'طعميه صعيديه', 
    'طعميه عين الكتكوت محشيه شرائح بيض', 'ارز', 'رز بشعيرية', 'رز ابيض', 'رز سمك', 'رز محمر', 'كشري', 'محشي', 'رز باللبن', 'رز معمر', 'لحمه مفرومه', 
    'فريك', 'محشي الكرنب', 'محشي باذنجان', 'كرنب', 'محشي خس', 'محشي كوسه', 'محشي بطاطس', 'محشي بصل', 'لحم بقري', 'لحم جاموسي', 'كباب حله', 'عكاوي', 
    'كرشة', 'كوارع', 'حلويات (وتكون جوار الكبد)', 'ممبار', 'فشه', 'كبده', 'لحم خروف (ضاني)', 'لحم الماعز', 'ارنب', 'لحم غزال', 'فراخ', 'فراخ محشيه ارز', 
    'فراخ محشيه فريك', 'فراخ مع صينية بطاطس', 'بط', 'وز', 'ديك رومي', 'لحم نعام', 'سمك', 'سمك مقلي', 'سمك سنجاري', 'سمك بلطي (شبار)', 'قراميط', 'سردين', 
    'جمبري', 'بوري', 'سلطة خضراء', 'سلطة بابا غنوج', 'سلطة طحينة بيضاء', 'جرجير', 'فجل اخضر', 'بصل اخضر', 'كرات اخضر', 'شوربة عدس', 'مكرونه بالصلصه',
    'مسقعه', 'تقليه', 'ثوميه', 'صياديه', 'سمك مشوي', 'فته', 'حمام محشي بالفريك', 'طرشي', 'مخلل ليمون', 'مخلل جزر', 'مخلل جزر', 'مخلل لفت', 'مخلل خيار', 
    'مخلل بصل', 'سمك صينية بالليمون والزيت', 'رقاق باللحمه المفرومه', 'كبده اسكندراني', 'مديدة', 'مفتأه', 'مخروطه', 'كفته داود باشا', 'كفتة أرز', 
    'كفتة جمبري', 'طرب (كفته المنديل الضاني)', 'بتاو', 'فايش', 'عيش شمسي', 'قراقيش', 'ملانة', 'منين بالعجوة', 'قُرَص', 'سميط', 'جبنه قديمه', 'زبدة بلدي', 
    'زبدة صفرة', 'مش', 'سمنه', 'مورته', 'قشطه', 'كريمه لباني', 'رنجه'
];

/*Accessing the button the user will */
let btn = document.getElementById('generate_button');
// let bd = document.getElementsByTagName('body');
let para = document.getElementById('generated-food');

function randInt(min, max) {
    return Math.trunc( Math.random() * max );
}

btn.addEventListener('click', () => {
    let generated = data[randInt(0,data.length)];
    para.textContent = `${generated}`;
    // let br = document.createElement('br');
    // para.appendChild(br);
    // para.textContent +=  + '';
});

